Revit 2027 API
ParameterTypeId.PartMakerSplitterProfileEdgeMatch Property
 "Edge Match"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PartMakerSplitterProfileEdgeMatch { get; }
Public Shared ReadOnly Property PartMakerSplitterProfileEdgeMatch As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PartMakerSplitterProfileEdgeMatch {
	ForgeTypeId^ get ();
}
static member PartMakerSplitterProfileEdgeMatch : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace